Revit 2024 API
UnitTypeId.MeganewtonMeters Property
 Meganewton meters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId MeganewtonMeters { get; }
Visual Basic
Public Shared ReadOnly Property MeganewtonMeters As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ MeganewtonMeters {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace